<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Event;

class EventSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
{
    $events = [
        ['name' => 'ဘွဲ့တံဆိပ်တော်ရ ဆရာတော်များအား ဆွမ်းဆန်တော်ဝတ္ထုငွေဆက်ကပ်လှူဒါန်းခြင်း', 'month' => 'ဇန်နဝါရီလ','description' => 'ရဟန်းတော်များထံ တိုက်ရိုက်လှူဒါန်းမှသာဟတ္ထိက ဒါန ဖြစ်သည်မဟုတ်ပါ။ ရဟန်းတော်များကိုယ်စား ကိုရင်၊ကျောင်းသားစသူတို့ထံမိမိကိုယ်တိုင်လှူဒါန်း လျှင်လည်း သာဟတ္ထိကဒါနပင်ဖြစ်ပါ သည်။'],
['name' => 'ပြည်မြို့နယ်စူဠဘွဲ့နှင်းသဘင်အခမ်းအနား', 'month' => 'ဖေဖော်ဝါရီ','description' => 'ပြည်မြို့၌ (၁၁)ကြိမ်မြောက် စူဠဘွဲ့နှင်းသဘင် အခမ်းအနားသို့ တိုင်းဒေသကြီး ဝန်ကြီးချုပ် တက်ရောက် ကြည်ညို ကျင်းပပြုလုပ်'],
['name' => 'ဓမ္မာစရိယနှင့် ပထမပြန်စာပေးပွဲကျင်းပခြင်း', 'month' => 'မတ်လ,ဧပြီလ','description' => 'ပထမပြန်စာမေးပွဲကို ၁၂၅၇-ခုနှစ် (၁၈၉၅-ဇွန်လ) နယုန်လ စတင်ကျင်းပသည်။'],
['name' => 'နိုင်ငံတော်သံဃာနာယကအဖွဲ့၊ နိုင်ငံတော်ဗဟိုသံဃာ့ဝန်ဆောင်အစည်းအဝေး၊ ဘွဲ့တံဆိပ်တော်ဆက်ကပ်ပွဲနှင့် ဆွမ်းဆန်စိမ်းလောင်းလှူပွဲ', 'month' => 'မတ်လ','description' => 'နိုင်ငံတော် သံဃမဟာနာယကအဖွဲ့ (အတိုကောက် မဟန) သည် သာသနာတော် သန့်ရှင်းတည်တံ့ပြန့်ပွားရေးအတွက် နိုင်ငံတော်အစိုးရက ခန့်အပ်ထားသည့် အဆင့်အမြင့်ဆုံး သံဃအဖွဲ့အစည်းဖြစ်သည်။'],
['name' => 'မတန(၄၇)ပါး အစည်းအဝေး', 'month' => 'မတ်လ,ဇူလိုင်လ,နို၀င်ဘာလ','description' => 'ပြည်ထောင်စုသမ္မတမြန်မာနိုင်ငံတော် အဋ္ဌမအကြိမ် နိုင်ငံတော်သံဃမဟာ နာယကအဖွဲ့ ၄၇ ပါးစုံညီ တေရသမအစည်းအဝေး ပထမနေ့ကို  ရန်ကုန်မြို့ သီရိမင်္ဂလာ ကမ္ဘာအေးကုန်းမြေ၊ ဝိဇယမင်္ဂလာဓမ္မသဘင်၌ ကျင်းပသည်။'],
['name' => 'ဗုဒ္ဓဘာသာယဉ်ကျေးမှုစာပေးပွဲကျင်းပခြင်း', 'month' => 'မေလ','description' => 'နိုင်ငံတော်သံဃမဟာနာယကအဖွဲ့၏ ကြီးကြပ်မှုဖြင့် မြို့နယ်သံဃနာယကအဖွဲ့မှ တာဝန်ယူ ကျင်းပသော (၃၈) ကြိမ်မြောက် ဗုဒ္ဓဘာသာယဉ်ကျေးမှုစာမေးပွဲ'],
['name' => 'နိကာယ်စာပေးပွဲကျင်းပခြင်း', 'month' => 'ဇွန်လ','description' => 'နိုင်ငံတော်သံဃမဟာနာယကအဖွဲ့၏ ကြီးကြပ်မှုဖြင့် မြို့နယ်သံဃနာယကအဖွဲ့မှ တာဝန်ယူ ကျင်းပသော (၃၈) ကြိမ်မြောက် နိကာယ်စာပေးပွဲကျင်းပခြင်း'],
['name' => 'ဝါဆိုသံဃာစာရင်းကောက်ယူခြင်း', 'month' => 'ဇွန်လ','description' => '၊ ဝါဆိုသံဃာစာရင်းကို မူအားဖြင့်ပင်မအဖွဲ့ဝင်များကိုယ်တိုင် အထောက်အကူပြုအဖွဲ့ ဝင်များ၏ အကူအညီဖြင့် ကောက်ယူရန်ဖြစ်သည်။'],
['name' => 'ဘွဲ့တံဆိပ်တော်များ စိစစ်လက်ခံ/တင်ပြခြင်း', 'month' => 'ဇွန်လ,ဇူလိုင်လ','description' => 'ဘွဲ့တံဆိပ်ဟူသည် အလှူကိုခံယူထိုက်သော ပုဂ္ဂိုလ်ထူး၊ ပုဂ္ဂိုလ်မြတ်တို့၏ အမှတ်အသားအဆောင်အယောင်များ ဖြစ်သည်။ '],
['name' => 'စာအောင်ဆုရစာအုပ်များ ဖြန့်ဝေခြင်း', 'month' => 'ဩဂုတ်လ,စက်တင်ဘာလ','description' => 'ဘွဲ့တံဆိပ်ဟူသည် အလှူကိုခံယူထိုက်သော ပုဂ္ဂိုလ်ထူး၊ ပုဂ္ဂိုလ်မြတ်တို့၏ အမှတ်အသားအဆောင်အယောင်များ ဖြစ်သည်။ '],
['name' => 'ပြည်မြို့၊ ပြည်တောင်တန်းတောရကျောင်းများ ဆွမ်းဆန်စိမ်းလောင်းလှူပွဲ အခမ်းအနား', 'month' => 'စက်တင်ဘာလ','description' => '၂၀၂၄ ခုနှစ် သာသနာတော်ဆိုင်ရာ ဘွဲ့တံဆိပ်တော်များ ဆက်ကပ်ပူဇော်ပွဲ မဟာမင်္ဂလာအခမ်းအနားနှင့် ဆွမ်းဆန်စိမ်းလောင်းလှူပွဲအခမ်းအနား ကျင်းပ'],
['name' => 'ပြည်မြို့၊ ရွှေဆံတော်စေတီတော်ဗုဒ္ဓပူဇနိယပွဲတော်', 'month' => 'အောက်တိုဘာလ','description' => 'ဗုဒ္ဓပူဇနိယပွဲတော်တွင် ဇာတ်သဘင်၊ ဆပ်ကပ်၊ စတိတ်ရှိုး စသည့်ဖျော်ဖြေပွဲများ ပါဝင်မည်ဖြစ်ကြောင်း သိရသည်။'],
['name' => 'စုပေါင်းမတာဘုံကထိန်အခမ်းအနား', 'month' => 'အောက်တိုဘာလ','description' => '၂၀၂၃၊ နို ၂၈ — ပဲခူတိုင်းဒေသကြီး၊ ပြည်မြို့ ကျက်သရေဆောင် သီရိခေတ္တသိရိန္ဒရ သာသနာ့ဗိမာန်တော်ကြီး၌ ယမန်နေ့မွန်းလွဲ ၁ နာရီက စုပေါင်းမဟာဘုံကထိန် အလှူတော်မင်္ဂလာအခမ်းအနားကို ကျင်းပပြုလုပ်သည်။'],
['name' => 'ဓမ္မာစရိယနှင့် ပထမပြန်ဝင်ခွင့်လွှာများစိစစ်ခြင်း', 'month' => 'အောက်တိုဘာလ,နို၀င်ဘာလ','description' => 'ဘွဲ့တံဆိပ်ဟူသည် အလှူကိုခံယူထိုက်သော ပုဂ္ဂိုလ်ထူး၊ ပုဂ္ဂိုလ်မြတ်တို့၏ အမှတ်အသားအဆောင်အယောင်များ ဖြစ်သည်။ '],
['name' => 'ပထပပြန်နှင့် ဓမ္မာစရိယဝင်ခွင့်ပုံစံများဖြန့်ဝေခြင်း', 'month' => 'နို၀င်ဘာလ,ဒီဇင်ဘာလ','description' => 'ဘွဲ့တံဆိပ်ဟူသည် အလှူကိုခံယူထိုက်သော ပုဂ္ဂိုလ်ထူး၊ ပုဂ္ဂိုလ်မြတ်တို့၏ အမှတ်အသားအဆောင်အယောင်များ ဖြစ်သည်။ '],
['name' => 'အဘိဓမ္မာစာပေးပွဲကျင်းပခြင်း', 'month' => 'ဒီဇင်ဘာလ','description' => 'ဘွဲ့တံဆိပ်ဟူသည် အလှူကိုခံယူထိုက်သော ပုဂ္ဂိုလ်ထူး၊ ပုဂ္ဂိုလ်မြတ်တို့၏ အမှတ်အသားအဆောင်အယောင်များ ဖြစ်သည်။ '],
['name' => 'စာတိုက်တန်းလမ်း စာရေးတံမဲပွဲကျင်းပခြင်း', 'month' => 'ဒီဇင်ဘာလ','description' => 'စာရေးတံမဲ စာရေးတံမဲ ပွဲတော်ကို ဘုရားရှင်လက်ထက်တော်အခါကပင် ကျင်း ပခဲ့သောအအလှူ ပွဲဖြစ်သည်။အခါတစ်ပါးတွင် မြတ်စွာ ဘုရားရှင်သည် ရာဇဂြိုလ်ပြည်ဝေဠုဝန်ကျောင်းတော်၌ သီတင်းသုံးတော်မူ၏။'],['name' => 'ပထမပြန်စာအောင်ဆုငွေများဆတ်ကပ်ခြင်း', 'month' => 'ဒီဇင်ဘာလ','description' => 'ဗုဒ္ဓသာသနာတော်၏ အခြေအမြစ်ဖြစ်သော ပရိယတ္တိသာသနာတော်ကြီး ထွန်းကားရေးကို အဓိကထား၍ ပါဠိပထမပြန်စာမေးပွဲကို သာလွန်မင်းတရားကြီးလက်ထက် သက္ကရာဇ်(၁၀၀၀)ပြည့် နှစ်၊ ခရစ်နှစ် (၁၆၃၈)ခုနှစ်တွင်စတင်ကျင်းပခဲ့ပါသည်။'],
    ];
    
    
    
    
    
    foreach ($events as $event) {
        Event::create($event);
    }
}

}
