<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Event;

class EventSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
{
    $events = [
        ['name' => 'ဝါဆို သင်္ကန်း ကပ်လှု ပူဇော်ပွဲ', 'month' => 'ဝါဆိုလ','description' => '“ဝါဆိုသင်္ကန်းလို့ ဆိုလိုက်လျှင် ဝါဆိုသောအခါဝတ်ရုံတဲ့ သင်္ကန်းကို ဝါဆိုသင်္ကန်းလို့ မှတ်ထင်နေကြသည်။သို့သော် ပါဠိတော်မှာလာတဲ့ ဝါဆိုသင်္ကန်းကဝါဆိုရန် ဝတ်ရုံတဲ့ သင်္ကန်းမဟုတ်ဘဲ ဝါတွင်းသုံးလဝါသို့ကပ်၍ ဝါကျိုး ဝါပြတ်ခြင်းမရှိဘဲ နေလေ့ရှိသောရဟန်းတော်တို့အား လှူဒါန်းအပ်သောသင်္ကန်းဖြစ်သောကြောင့်လည်းကောင်း၊ဝါတွင်းသုံးလပတ်လုံး မိုးတွင်းအခါ သိက္ခာမညှိုးဘဲနေလေ့ရှိသော ရဟန်းတော်တို့သည်သာခံယူထိုက်သည်ဖြစ်၍ ယင်းရဟန်းတော်တို့၏ဥစ္စာဖြစ်သောကြောင့်လည်းကောင်း“ဝဿဝါသိကစီဝရ-ဝါဆိုသင်္ကန်း”ဟုခေါ်၏။'],
        ['name' => 'ဆွမ်းဆန်စိမ်း လောင်းလှု ပူဇော်ပွဲ', 'month' => 'တပေါင်းလ','description' => 'ဗုဒ္ဓပူဇနိယပွဲတော် နှင့် ဆွမ်းဆန်စိမ်းလောင်းလှူပွဲ ကျင်းပမည် by Popular News Journal "လိုပြည့်အေးချမ်းသာဆုတောင်းပြည့်စေတီတော်မြတ်ကြီး၏ (၁၀)ကြိမ်မြောက် ဗုဒ္ဓပူဇနိယပွဲတော်'],
        ['name' => 'ကထိန်သင်္ကန်း ဆက်ကပ်ပွဲ', 'month' => 'သီတင်းကျွတ်လ','description' => 'ကထိန်အလှူတော်သည် သီတင်းကျွတ်လပြည့်ကျော် ၁ ရက်နေ့မှ တန်ဆောင်မုန်းလပြည့်နေ့အထိ တစ်လတာအတွင်း ခင်းကြရသည်။'],
        ['name' => 'သံဃာအား ဂုဏ်ထူးဘွဲ့ထူးများ ချီးမြင့် ပူဇော်ပွဲ', 'month' => 'ကဆုန်လ','description' => 'နိုင်ငံခြားသံတမန်များနှင့် ပုဂ္ဂိုလ်များအား လည်းကောင်း ထိုက်တန်သော ဂုဏ်ထူးဆောင်ဘွဲ့များ၊ ဂုဏ်ထူးဆောင်တံဆိပ်များချီးမြှင့်နိုင်ရန်နှင့် သာသနာရေးဆိုင်ရာဘွဲ့တံဆိပ် တော်များ'],
        ['name' => 'အဘိဓမ္မာစာမေးပွဲအောင် ချီးမြင့်ပူဇော်ပွဲ', 'month' => 'ဝါခေါင်လ','description' => 'နိုင်ငံခြားသံတမန်များနှင့် ပုဂ္ဂိုလ်များအား လည်းကောင်း ထိုက်တန်သော ဂုဏ်ထူးဆောင်ဘွဲ့များ၊ ဂုဏ်ထူးဆောင်တံဆိပ်များချီးမြှင့်နိုင်ရန်နှင့် သာသနာရေးဆိုင်ရာဘွဲ့တံဆိပ် တော်များ'],
    ];
    
    
    
    
    
    foreach ($events as $event) {
        Event::create($event);
    }
}

}
